ahtn/keyplus/ports/efm8/efm8/mcu/C8051F550/inc/SI_C8051F550_Register_Enums.h
#define CAN0IF2A2H_XTD__BMASK      0x40 ///< Extended Identifier Select                       
#define CAN0IF2A2H_XTD__SHIFT      0x06 ///< Extended Identifier Select                       
#define CAN0IF2A2H_XTD__STANDARD   0x00 ///< The 11-bit standard identifier will be used for  
                                        ///< this message object.                             
#define CAN0IF2A2H_XTD__EXTENDED   0x40 ///< The 29-bit extended identifier will be used for  
                                        ///< this message object.                             
                                                                                              
#define CAN0IF2A2H_MSGVLD__BMASK   0x80 ///< Message Valid Flag                               
#define CAN0IF2A2H_MSGVLD__SHIFT   0x07 ///< Message Valid Flag                               
#define CAN0IF2A2H_MSGVLD__NOT_SET 0x00 ///< The message object is ignored by the message     
                                        ///< handler.                                         
#define CAN0IF2A2H_MSGVLD__SET     0x80 ///< The message object is configured and should be   
                                        ///< considered by the message handler.               
                                                                                              
//------------------------------------------------------------------------------
// CAN0IF2A2L Enums (CAN Interface 2 Arbitration 2 Low @ 0xF2)
//------------------------------------------------------------------------------
#define CAN0IF2A2L_ID__FMASK 0xFF ///< Interface 2 Message Identifier
#define CAN0IF2A2L_ID__SHIFT 0x00 ///< Interface 2 Message Identifier
                                                                     
//------------------------------------------------------------------------------
// CAN0IF2CMH Enums (CAN Interface 2 Command Mask High @ 0xE3)
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
// CAN0IF2CML Enums (CAN Interface 2 Command Mask Low @ 0xE2)
//------------------------------------------------------------------------------
#define CAN0IF2CML_DATAB__BMASK             0x01 ///< Access Data Bytes 4-7                             
#define CAN0IF2CML_DATAB__SHIFT             0x00 ///< Access Data Bytes 4-7                             
#define CAN0IF2CML_DATAB__DO_NOT_TRANSFER   0x00 ///< Data bytes 4-7 are unchanged.                     
#define CAN0IF2CML_DATAB__TRANSFER          0x01 ///< On a write, transfer data bytes 4-7 to the message
                                                 ///< object. On a read, transfer data bytes 4-7 to the 
                                                 ///< IFx message buffer register.                      
                                                                                                        
#define CAN0IF2CML_DATAA__BMASK             0x02 ///< Access Data Bytes 0-3                             
#define CAN0IF2CML_DATAA__SHIFT             0x01 ///< Access Data Bytes 0-3                             
#define CAN0IF2CML_DATAA__DO_NOT_TRANSFER   0x00 ///< Data bytes 0-3 are unchanged.                     
#define CAN0IF2CML_DATAA__TRANSFER          0x02 ///< On a write, transfer data bytes 0-3 to the message
                                                 ///< object. On a read, transfer data bytes 0-3 to the 
                                                 ///< IFx message buffer register.                      
                                                                                                        
#define CAN0IF2CML_TXRND__BMASK             0x04 ///< Access Transmission Request                       
#define CAN0IF2CML_TXRND__SHIFT             0x02 ///< Access Transmission Request                       
#define CAN0IF2CML_TXRND__DO_NOT_CHANGE     0x00 ///< On a write, the TXRQST bit is unchanged. On a     
                                                 ///< read, the NEWDAT bit remains unchanged.           
#define CAN0IF2CML_TXRND__SET_OR_CLEAR      0x04 ///< On a write, set the TXRQST bit. On a read, clear  
                                                 ///< the NEWDAT bit in the message object.             
                                                                                                        
#define CAN0IF2CML_CLRINTPND__BMASK         0x08 ///< Clear Interrupt Pending                           
#define CAN0IF2CML_CLRINTPND__SHIFT         0x03 ///< Clear Interrupt Pending                           
#define CAN0IF2CML_CLRINTPND__DO_NOT_CLEAR  0x00 ///< The INTPND bit remains unchanged.                 
#define CAN0IF2CML_CLRINTPND__CLEAR         0x08 ///< Clear the INTPND bit in the message object.       
                                                                                                        
#define CAN0IF2CML_CONTROL__BMASK           0x10 ///< Access Control                                    
#define CAN0IF2CML_CONTROL__SHIFT           0x04 ///< Access Control                                    
#define CAN0IF2CML_CONTROL__DO_NOT_TRANSFER 0x00 ///< Do not transfer the control bits.                 
#define CAN0IF2CML_CONTROL__TRANSFER        0x10 ///< On a write, transfer the control bits to the      
                                                 ///< message object. On a read, transfer the control   
                                                 ///< bits to the IFx message buffer register.          
                                                                                                        
#define CAN0IF2CML_ARB__BMASK               0x20 ///< Access Arbitration                                
#define CAN0IF2CML_ARB__SHIFT               0x05 ///< Access Arbitration                                
#define CAN0IF2CML_ARB__DO_NOT_TRANSFER     0x00 ///< Do not transfer the arbitration bits.             
#define CAN0IF2CML_ARB__TRANSFER            0x20 ///< On a write, transfer the identifier + DIR + XTD + 
                                                 ///< MSGVAL to the message object. On a read, transfer 
                                                 ///< the identifier + DIR + XTD+ MSGVAL to the IFx     
                                                 ///< message buffer register.                          
                                                                                                        
#define CAN0IF2CML_MASK__BMASK              0x40 ///< Access Mask                                       
#define CAN0IF2CML_MASK__SHIFT              0x06 ///< Access Mask                                       
#define CAN0IF2CML_MASK__DO_NOT_TRANSFER    0x00 ///< Do not transfer the mask bits.                    
#define CAN0IF2CML_MASK__TRANSFER           0x40 ///< On a write, transfer the identifier mask + MDIR + 
                                                 ///< MXTD to the message object. On a read, transfer   
                                                 ///< the identifier mask + MDIR + MXTD to the IFx      
                                                 ///< message buffer register.                          
                                                                                                        
