ahtn/keyplus/ports/efm8/efm8/mcu/C8051F550/inc/SI_C8051F550_Register_Enums.h
#define CAN0IF2CML_WRRD__BMASK              0x80 ///< Write / Read Direction Control                    
#define CAN0IF2CML_WRRD__SHIFT              0x07 ///< Write / Read Direction Control                    
#define CAN0IF2CML_WRRD__READ               0x00 ///< Read: transfer data from the message object       
                                                 ///< addressed by the command request register into the
                                                 ///< selected message buffer registers.                
#define CAN0IF2CML_WRRD__WRITE              0x80 ///< Write: transfer data from the selected message    
                                                 ///< buffer registers to the message object addressed  
                                                 ///< by the command request register.                  
                                                                                                        
//------------------------------------------------------------------------------
// CAN0IF2CRH Enums (CAN Interface 2 Command Request High @ 0xDF)
//------------------------------------------------------------------------------
#define CAN0IF2CRH_BUSY__BMASK   0x80 ///< Busy Flag                                       
#define CAN0IF2CRH_BUSY__SHIFT   0x07 ///< Busy Flag                                       
#define CAN0IF2CRH_BUSY__NOT_SET 0x00 ///< Set to 1 when writing to the IFx command request
                                      ///< register.                                       
#define CAN0IF2CRH_BUSY__SET     0x80 ///< Reset to 0 when the read or write action has    
                                      ///< finished.                                       
                                                                                           
//------------------------------------------------------------------------------
// CAN0IF2CRL Enums (CAN Interface 2 Command Request Low @ 0xDE)
//------------------------------------------------------------------------------
#define CAN0IF2CRL_MSGNUM__FMASK 0x3F ///< Message Number
#define CAN0IF2CRL_MSGNUM__SHIFT 0x00 ///< Message Number
                                                         
//------------------------------------------------------------------------------
// CAN0IF2DA1H Enums (CAN Interface 2 Data A 1 High @ 0xF7)
//------------------------------------------------------------------------------
#define CAN0IF2DA1H_DATA1__FMASK 0xFF ///< Interface 2 Data 1
#define CAN0IF2DA1H_DATA1__SHIFT 0x00 ///< Interface 2 Data 1
                                                             
//------------------------------------------------------------------------------
// CAN0IF2DA1L Enums (CAN Interface 2 Data A 1 Low @ 0xF6)
//------------------------------------------------------------------------------
#define CAN0IF2DA1L_DATA0__FMASK 0xFF ///< Interface 2 Data 0
#define CAN0IF2DA1L_DATA0__SHIFT 0x00 ///< Interface 2 Data 0
                                                             
//------------------------------------------------------------------------------
// CAN0IF2DA2H Enums (CAN Interface 2 Data A 2 High @ 0xFB)
//------------------------------------------------------------------------------
#define CAN0IF2DA2H_DATA3__FMASK 0xFF ///< Interface 2 Data 3
#define CAN0IF2DA2H_DATA3__SHIFT 0x00 ///< Interface 2 Data 3
                                                             
//------------------------------------------------------------------------------
// CAN0IF2DA2L Enums (CAN Interface 2 Data A 2 Low @ 0xFA)
//------------------------------------------------------------------------------
#define CAN0IF2DA2L_DATA2__FMASK 0xFF ///< Interface 2 Data 2
#define CAN0IF2DA2L_DATA2__SHIFT 0x00 ///< Interface 2 Data 2
                                                             
//------------------------------------------------------------------------------
// CAN0IF2DB1H Enums (CAN Interface 2 Data B 1 High @ 0xFD)
//------------------------------------------------------------------------------
#define CAN0IF2DB1H_DATA5__FMASK 0xFF ///< Interface 2 Data 5
#define CAN0IF2DB1H_DATA5__SHIFT 0x00 ///< Interface 2 Data 5
                                                             
//------------------------------------------------------------------------------
// CAN0IF2DB1L Enums (CAN Interface 2 Data B 1 Low @ 0xFC)
//------------------------------------------------------------------------------
#define CAN0IF2DB1L_DATA4__FMASK 0xFF ///< Interface 2 Data 4
#define CAN0IF2DB1L_DATA4__SHIFT 0x00 ///< Interface 2 Data 4
                                                             
//------------------------------------------------------------------------------
// CAN0IF2DB2H Enums (CAN Interface 2 Data B 2 High @ 0xFF)
//------------------------------------------------------------------------------
#define CAN0IF2DB2H_DATA7__FMASK 0xFF ///< Interface 2 Data 7
#define CAN0IF2DB2H_DATA7__SHIFT 0x00 ///< Interface 2 Data 7
                                                             
//------------------------------------------------------------------------------
// CAN0IF2DB2L Enums (CAN Interface 2 Data B 2 Low @ 0xFE)
//------------------------------------------------------------------------------
#define CAN0IF2DB2L_DATA6__FMASK 0xFF ///< Interface 2 Data 6
#define CAN0IF2DB2L_DATA6__SHIFT 0x00 ///< Interface 2 Data 6
                                                             
//------------------------------------------------------------------------------
// CAN0IF2M1H Enums (CAN Interface 2 Mask 1 High @ 0xEB)
//------------------------------------------------------------------------------
#define CAN0IF2M1H_MSK__FMASK 0xFF ///< Interface 2 Identifier Mask
#define CAN0IF2M1H_MSK__SHIFT 0x00 ///< Interface 2 Identifier Mask
                                                                   
//------------------------------------------------------------------------------
// CAN0IF2M1L Enums (CAN Interface 2 Mask 1 Low @ 0xEA)
//------------------------------------------------------------------------------
#define CAN0IF2M1L_MSK__FMASK 0xFF ///< Interface 2 Identifier Mask
#define CAN0IF2M1L_MSK__SHIFT 0x00 ///< Interface 2 Identifier Mask
                                                                   
//------------------------------------------------------------------------------
// CAN0IF2M2H Enums (CAN Interface 2 Mask 2 High @ 0xED)
//------------------------------------------------------------------------------
#define CAN0IF2M2H_MSK__FMASK     0x1F ///< Interface 2 Identifier Mask                       
#define CAN0IF2M2H_MSK__SHIFT     0x00 ///< Interface 2 Identifier Mask                       
                                                                                              
#define CAN0IF2M2H_MDIR__BMASK    0x40 ///< Mask Message Direction                            
#define CAN0IF2M2H_MDIR__SHIFT    0x06 ///< Mask Message Direction                            
#define CAN0IF2M2H_MDIR__DISABLED 0x00 ///< The message direction bit (DIR) has no effect on  
                                       ///< the acceptance filtering.                         
#define CAN0IF2M2H_MDIR__ENABLED  0x40 ///< The message direction bit (DIR) is used for       
                                       ///< acceptance filtering.                             
                                                                                              
#define CAN0IF2M2H_MXTD__BMASK    0x80 ///< Mask Extended Identifier                          
#define CAN0IF2M2H_MXTD__SHIFT    0x07 ///< Mask Extended Identifier                          
#define CAN0IF2M2H_MXTD__DISABLED 0x00 ///< The extended identifier bit (IDE) has no effect on
                                       ///< the acceptance filtering.                         
#define CAN0IF2M2H_MXTD__ENABLED  0x80 ///< The extended identifier bit (IDE) is used for     
                                       ///< acceptance filtering.                             
                                                                                              
//------------------------------------------------------------------------------
// CAN0IF2M2L Enums (CAN Interface 2 Mask 2 Low @ 0xEC)
//------------------------------------------------------------------------------
#define CAN0IF2M2L_MSK__FMASK 0xFF ///< Interface 2 Identifier Mask
#define CAN0IF2M2L_MSK__SHIFT 0x00 ///< Interface 2 Identifier Mask
                                                                   
//------------------------------------------------------------------------------
// CAN0IF2MCH Enums (CAN Interface 2 Message Control High @ 0xCF)
//------------------------------------------------------------------------------
#define CAN0IF2MCH_TXRQST__BMASK   0x01 ///< Transmit Request Flag                             
#define CAN0IF2MCH_TXRQST__SHIFT   0x00 ///< Transmit Request Flag                             
#define CAN0IF2MCH_TXRQST__NOT_SET 0x00 ///< The message object is not waiting for             
                                        ///< transmission.                                     
#define CAN0IF2MCH_TXRQST__SET     0x01 ///< The transmission of this message object is        
                                        ///< requested and is not yet done.                    
                                                                                               
