ahtn/keyplus/ports/efm8/efm8/mcu/C8051F550/inc/SI_C8051F550_Register_Enums.h
#define PSCTL_PSEE__BMASK          0x02 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__SHIFT          0x01 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__ERASE_DISABLED 0x00 ///< Flash program memory erasure disabled.          
#define PSCTL_PSEE__ERASE_ENABLED  0x02 ///< Flash program memory erasure enabled.           
                                                                                             
//------------------------------------------------------------------------------
// OSCICN Enums (High Frequency Oscillator Control @ 0xA1)
//------------------------------------------------------------------------------
#define OSCICN_IFCN__FMASK         0x07 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__SHIFT         0x00 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__HFOSC_DIV_128 0x00 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 128.                                  
#define OSCICN_IFCN__HFOSC_DIV_64  0x01 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 64.                                   
#define OSCICN_IFCN__HFOSC_DIV_32  0x02 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 32.                                   
#define OSCICN_IFCN__HFOSC_DIV_16  0x03 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 16.                                   
#define OSCICN_IFCN__HFOSC_DIV_8   0x04 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 8.                                    
#define OSCICN_IFCN__HFOSC_DIV_4   0x05 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 4.                                    
#define OSCICN_IFCN__HFOSC_DIV_2   0x06 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 2.                                    
#define OSCICN_IFCN__HFOSC_DIV_1   0x07 ///< SYSCLK derived from High Frequency Oscillator    
                                        ///< divided by 1.                                    
                                                                                              
#define OSCICN_IFRDY__BMASK        0x10 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__SHIFT        0x04 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__NOT_SET      0x00 ///< The Internal High Frequency Oscillator is not    
                                        ///< running at the programmed frequency.             
#define OSCICN_IFRDY__SET          0x10 ///< The Internal High Frequency Oscillator is running
                                        ///< at the programmed frequency.                     
                                                                                              
#define OSCICN_SUSPEND__BMASK      0x20 ///< Oscillator Suspend Enable                        
#define OSCICN_SUSPEND__SHIFT      0x05 ///< Oscillator Suspend Enable                        
#define OSCICN_SUSPEND__DISABLED   0x00 ///< The internal oscillator is not in suspend mode.  
#define OSCICN_SUSPEND__ENABLED    0x20 ///< Place the internal oscillator in suspend mode.   
                                                                                              
#define OSCICN_IOSCEN__FMASK       0xC0 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__SHIFT       0x06 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__DISABLED    0x00 ///< Disable the High Frequency Oscillator.           
#define OSCICN_IOSCEN__ENABLED     0xC0 ///< Oscillator enabled in normal mode and disabled in
                                        ///< Suspend mode.                                    
                                                                                              
//------------------------------------------------------------------------------
// OSCICRS Enums (High Frequency Oscillator Coarse Calibration @ 0xA2)
//------------------------------------------------------------------------------
#define OSCICRS_OSCICRS__FMASK 0x7F ///< Internal Oscillator Coarse Calibration
#define OSCICRS_OSCICRS__SHIFT 0x00 ///< Internal Oscillator Coarse Calibration
                                                                               
//------------------------------------------------------------------------------
// OSCIFIN Enums (High Frequency Oscillator Fine Calibration @ 0x9E)
//------------------------------------------------------------------------------
#define OSCIFIN_OSCIFIN__FMASK 0x3F ///< Internal Oscillator Fine Calibration
#define OSCIFIN_OSCIFIN__SHIFT 0x00 ///< Internal Oscillator Fine Calibration
                                                                             
//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_ESMB0__BMASK     0x01 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__SHIFT     0x00 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__DISABLED  0x00 ///< Disable all SMB0 interrupts.                      
#define EIE1_ESMB0__ENABLED   0x01 ///< Enable interrupt requests generated by SMB0.      
                                                                                          
#define EIE1_EWADC0__BMASK    0x02 ///< Window Comparison ADC0 Interrupt Enable           
#define EIE1_EWADC0__SHIFT    0x01 ///< Window Comparison ADC0 Interrupt Enable           
#define EIE1_EWADC0__DISABLED 0x00 ///< Disable ADC0 Window Comparison interrupt.         
#define EIE1_EWADC0__ENABLED  0x02 ///< Enable interrupt requests generated by ADC0 Window
                                   ///< Compare flag (ADWINT).                            
                                                                                          
#define EIE1_EADC0__BMASK     0x04 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__SHIFT     0x02 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__DISABLED  0x00 ///< Disable ADC0 Conversion Complete interrupt.       
#define EIE1_EADC0__ENABLED   0x04 ///< Enable interrupt requests generated by the ADINT  
                                   ///< flag.                                             
                                                                                          
