ahtn/keyplus/ports/efm8/efm8/mcu/C8051F550/inc/SI_C8051F550_Register_Enums.h
#define SBCON0_SBRUN__BMASK    0x40 ///< Baud Rate Generator Enable                     
#define SBCON0_SBRUN__SHIFT    0x06 ///< Baud Rate Generator Enable                     
#define SBCON0_SBRUN__DISABLED 0x00 ///< Disable the baud rate generator. UART0 will not
                                    ///< function.                                      
#define SBCON0_SBRUN__ENABLED  0x40 ///< Enable the baud rate generator.                
                                                                                        
//------------------------------------------------------------------------------
// SBRLH0 Enums (UART0 Baud Rate Generator High Byte @ 0xAD)
//------------------------------------------------------------------------------
#define SBRLH0_SBRL__FMASK 0xFF ///< UART0 Baud Rate Reload High
#define SBRLH0_SBRL__SHIFT 0x00 ///< UART0 Baud Rate Reload High
                                                                
//------------------------------------------------------------------------------
// SBRLL0 Enums (UART0 Baud Rate Generator Low Byte @ 0xAC)
//------------------------------------------------------------------------------
#define SBRLL0_SBRL__FMASK 0xFF ///< UART0 Baud Rate Reload Low
#define SBRLL0_SBRL__SHIFT 0x00 ///< UART0 Baud Rate Reload Low
                                                               
//------------------------------------------------------------------------------
// SBUF0 Enums (UART0 Serial Port Data Buffer @ 0x99)
//------------------------------------------------------------------------------
#define SBUF0_SBUF0__FMASK 0xFF ///< Serial Port Data Buffer
#define SBUF0_SBUF0__SHIFT 0x00 ///< Serial Port Data Buffer
                                                            
//------------------------------------------------------------------------------
// SCON0 Enums (UART0 Serial Port Control @ 0x98)
//------------------------------------------------------------------------------
#define SCON0_RI__BMASK             0x01 ///< Receive Interrupt Flag                            
#define SCON0_RI__SHIFT             0x00 ///< Receive Interrupt Flag                            
#define SCON0_RI__NOT_SET           0x00 ///< A byte of data has not been received by UART0.    
#define SCON0_RI__SET               0x01 ///< UART0 received a byte of data or data remains in  
                                         ///< the receive FIFO.                                 
                                                                                                
#define SCON0_TI__BMASK             0x02 ///< Transmit Interrupt Flag                           
#define SCON0_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                           
#define SCON0_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART0. 
#define SCON0_TI__SET               0x02 ///< UART0 transmitted a byte of data.                 
                                                                                                
#define SCON0_RBX__BMASK            0x04 ///< Extra Receive Bit                                 
#define SCON0_RBX__SHIFT            0x02 ///< Extra Receive Bit                                 
#define SCON0_RBX__LOW              0x00 ///< The extra bit or the first stop bit is 0.         
#define SCON0_RBX__HIGH             0x04 ///< The extra bit or the first stop bit is 1.         
                                                                                                
#define SCON0_TBX__BMASK            0x08 ///< Extra Transmission Bit                            
#define SCON0_TBX__SHIFT            0x03 ///< Extra Transmission Bit                            
#define SCON0_TBX__LOW              0x00 ///< Set extra bit to 0 (low).                         
#define SCON0_TBX__HIGH             0x08 ///< Set extra bit to 1 (high).                        
                                                                                                
#define SCON0_REN__BMASK            0x10 ///< Receive Enable                                    
#define SCON0_REN__SHIFT            0x04 ///< Receive Enable                                    
#define SCON0_REN__RECEIVE_DISABLED 0x00 ///< UART0 reception disabled.                         
#define SCON0_REN__RECEIVE_ENABLED  0x10 ///< UART0 reception enabled.                          
                                                                                                
#define SCON0_THRE__BMASK           0x20 ///< Transmit Holding Register Empty Flag              
#define SCON0_THRE__SHIFT           0x05 ///< Transmit Holding Register Empty Flag              
#define SCON0_THRE__NOT_SET         0x00 ///< The transmit holding register is not empty. Do not
                                         ///< write to SBUF0.                                   
#define SCON0_THRE__SET             0x20 ///< The transmit holding register is empty. It is safe
                                         ///< to write to SBUF0.                                
                                                                                                
#define SCON0_PERR__BMASK           0x40 ///< Parity Error Flag                                 
#define SCON0_PERR__SHIFT           0x06 ///< Parity Error Flag                                 
#define SCON0_PERR__NOT_SET         0x00 ///< Parity error has not occurred.                    
#define SCON0_PERR__SET             0x40 ///< Parity error has occurred.                        
                                                                                                
#define SCON0_OVR__BMASK            0x80 ///< Receive FIFO Overrun Flag                         
#define SCON0_OVR__SHIFT            0x07 ///< Receive FIFO Overrun Flag                         
#define SCON0_OVR__NOT_SET          0x00 ///< Receive FIFO overrun has not occurred.            
#define SCON0_OVR__SET              0x80 ///< Receive FIFO overrun has occurred.                
                                                                                                
//------------------------------------------------------------------------------
// SMOD0 Enums (UART0 Mode @ 0xA9)
//------------------------------------------------------------------------------
#define SMOD0_SBL__BMASK          0x01 ///< Stop Bit Length                                 
#define SMOD0_SBL__SHIFT          0x00 ///< Stop Bit Length                                 
#define SMOD0_SBL__SHORT          0x00 ///< Short: Stop bit is active for one bit time.     
#define SMOD0_SBL__LONG           0x01 ///< Long: Stop bit is active for two bit times (data
                                       ///< length = 6, 7, or 8 bits) or 1.5 bit times (data
                                       ///< length = 5 bits).                               
                                                                                            
#define SMOD0_XBE__BMASK          0x02 ///< Extra Bit Enable                                
#define SMOD0_XBE__SHIFT          0x01 ///< Extra Bit Enable                                
#define SMOD0_XBE__DISABLED       0x00 ///< Disable the extra bit.                          
#define SMOD0_XBE__ENABLED        0x02 ///< Enable the extra bit.                           
                                                                                            
#define SMOD0_SDL__FMASK          0x0C ///< Data Length                                     
#define SMOD0_SDL__SHIFT          0x02 ///< Data Length                                     
#define SMOD0_SDL__5_BITS         0x00 ///< 5 bits.                                         
#define SMOD0_SDL__6_BITS         0x04 ///< 6 bits.                                         
#define SMOD0_SDL__7_BITS         0x08 ///< 7 bits.                                         
#define SMOD0_SDL__8_BITS         0x0C ///< 8 bits.                                         
                                                                                            
#define SMOD0_PE__BMASK           0x10 ///< Parity Enable                                   
#define SMOD0_PE__SHIFT           0x04 ///< Parity Enable                                   
#define SMOD0_PE__PARITY_DISABLED 0x00 ///< Disable hardware parity.                        
#define SMOD0_PE__PARITY_ENABLED  0x10 ///< Enable hardware parity.                         
                                                                                            
#define SMOD0_SPT__FMASK          0x60 ///< Parity Type                                     
#define SMOD0_SPT__SHIFT          0x05 ///< Parity Type                                     
#define SMOD0_SPT__ODD_PARTY      0x00 ///< Odd.                                            
#define SMOD0_SPT__EVEN_PARITY    0x20 ///< Even.                                           
#define SMOD0_SPT__MARK_PARITY    0x40 ///< Mark.                                           
#define SMOD0_SPT__SPACE_PARITY   0x60 ///< Space.                                          
                                                                                            
#define SMOD0_MCE__BMASK          0x80 ///< Multiprocessor Communication Enable             
#define SMOD0_MCE__SHIFT          0x07 ///< Multiprocessor Communication Enable             
#define SMOD0_MCE__MULTI_DISABLED 0x00 ///< RI will be activated if the stop bits are 1.    
#define SMOD0_MCE__MULTI_ENABLED  0x80 ///< RI will be activated if the stop bits and extra 
                                       ///< bit are 1. The extra bit must be enabled using  
                                       ///< XBE.                                            
                                                                                            
//------------------------------------------------------------------------------
// VDM0CN Enums (VDD Supply Monitor Control @ 0xFF)
//------------------------------------------------------------------------------
#define VDM0CN_VDMLVL__BMASK      0x20 ///< VDD Monitor Threshold Level Select              
#define VDM0CN_VDMLVL__SHIFT      0x05 ///< VDD Monitor Threshold Level Select              
#define VDM0CN_VDMLVL__LOW        0x00 ///< VDD Monitor Threshold is set to VRST-LOW.       
#define VDM0CN_VDMLVL__HIGH       0x20 ///< VDD Monitor Threshold is set to VRST-HIGH. This 
                                       ///< setting is required for any system with firmware
                                       ///< that writes and/or erases flash.                
                                                                                            
#define VDM0CN_VDDSTAT__BMASK     0x40 ///< VDD Status                                      
#define VDM0CN_VDDSTAT__SHIFT     0x06 ///< VDD Status                                      
#define VDM0CN_VDDSTAT__VDD_BELOW 0x00 ///< VDD is at or below the VDD monitor threshold.   
#define VDM0CN_VDDSTAT__VDD_ABOVE 0x40 ///< VDD is above the VDD monitor threshold.         
                                                                                            
#define VDM0CN_VDMEN__BMASK       0x80 ///< VDD Monitor Enable                              
#define VDM0CN_VDMEN__SHIFT       0x07 ///< VDD Monitor Enable                              
#define VDM0CN_VDMEN__DISABLED    0x00 ///< Disable the VDD Monitor.                        
#define VDM0CN_VDMEN__ENABLED     0x80 ///< Enable the VDD Monitor.                         
                                                                                            
//------------------------------------------------------------------------------
// REF0CN Enums (Voltage Reference Control @ 0xD1)
//------------------------------------------------------------------------------
#define REF0CN_REFBE__BMASK         0x01 ///< Internal Reference Buffer Enable                  
#define REF0CN_REFBE__SHIFT         0x00 ///< Internal Reference Buffer Enable                  
#define REF0CN_REFBE__DISABLED      0x00 ///< Disable the internal reference buffer.            
#define REF0CN_REFBE__ENABLED       0x01 ///< Enable the internal reference buffer. The internal
                                         ///< voltage reference is driven on the VREF pin.      
                                                                                                
